// Написать программу которая на вход принимает число и выдает его квадрат
// умножение на самого себя

// Пример:
// 4 -> 16
// -3 -> 9
// 7-> 49


// Console.WriteLine("Введите число:"); Переведет на новую строку
//Console.Write("Введите число:"); Введение числа в той же строке
// int number = Convert.ToInt32(Console.ReadLine());
// int square = number * number ;
// System.Console.WriteLine($"Квадрат числа = {square}");


